#pragma once
#include <wut.h>
#include <coreinit/time.h>

/**
 * \defgroup padscore_wpad WPAD
 * \ingroup padscore
 *
 * WPAD is a low-level library under KPAD.
 *
 * @{
 */
#ifdef __cplusplus
extern "C" {
#endif

#define WPAD_MAX_IR_DOTS 4
#define WPAD_MAX_PRESSURE_SENSORS 4

typedef struct WPADStatusProController WPADStatusProController;
typedef struct WPADVec2D WPADVec2D;
typedef struct WPADVec3D WPADVec3D;
typedef struct WPADInfo WPADInfo;
typedef struct WPADAddress WPADAddress;
typedef struct WPADiQueueElement WPADiQueueElement;
typedef struct WPADiQueue WPADiQueue;
typedef struct WPADIRDot WPADIRDot;
typedef struct WPADStatus WPADStatus;
typedef struct WPADStatusNunchuk WPADStatusNunchuk;
typedef struct WPADStatusClassic WPADStatusClassic;
typedef struct WPADStatusMotionPlus WPADStatusMotionPlus;
typedef struct WPADStatusBalanceBoard WPADStatusBalanceBoard;
typedef struct WPADStatusTrain WPADStatusTrain;
typedef WPADStatusProController WPADStatusPro;

typedef enum WPADError
{
   WPAD_ERROR_NONE          =  0,
   WPAD_ERROR_NO_CONTROLLER = -1,
   WPAD_ERROR_NOT_READY     = -2,
   WPAD_ERROR_TRANSFER      = -3,
   WPAD_ERROR_INVALID       = -4,
   WPAD_ERROR_PERMISSION    = -5,
   WPAD_ERROR_BROKEN        = -6,
   WPAD_ERROR_QUEUE_EMPTY   = -7,
   WPAD_ERROR_BAD_VALUE     = -8,
   WPAD_ERROR_BAD_CONF      = -9,
} WPADError;

//! Wii Remote channel.
typedef enum WPADChan
{
   WPAD_CHAN_0 = 0,             //!< Channel 0.
   WPAD_CHAN_1 = 1,             //!< Channel 1.

   WPAD_PRO_STICK_L_EMULATION_RIGHT = 0x00080000, //!< The emulated right button on the left stick.
   WPAD_PRO_STICK_R_EMULATION_UP    = 0x02000000, //!< The emulated up button on the right stick.
   WPAD_PRO_STICK_R_EMULATION_DOWN  = 0x01000000, //!< The emulated down button on the right stick.
   WPAD_PRO_STICK_R_EMULATION_LEFT  = 0x00400000, //!< The emulated left button on the right stick.
   WPAD_PRO_STICK_R_EMULATION_RIGHT = 0x00800000, //!< The emulated right button on the right stick.
} WPADProButton;

//! WPAD Led flags
typedef enum WPADLed
{
   WPAD_LED_ONE   = 0x01,
   WPAD_LED_TWO   = 0x02,
   WPAD_LED_THREE = 0x04,
   WPAD_LED_FOUR  = 0x08,
} WPADLed;
WUT_ENUM_BITMASK_TYPE(WPADLed);

//!  WPAD Infrared Format. For more information see <a href="https://wiibrew.org/wiki/Wiimote#Data_Formats">IR Data Formats</a>
typedef enum WPADDpdFormat
{
   WPAD_DPD_FMT_NONE     = 0,   //!< Disable IR
   WPAD_DPD_FMT_BASIC    = 1,
   WPAD_DPD_FMT_EXTENDED = 3,
   WPAD_DPD_FMT_FULL     = 5,
} WPADDpdFormat;

//! WPAD Speaker Command.
typedef enum WPADSpeakerCmd
{
   WPAD_SPEAKER_CMD_OFF    = 0, //!< Deinitializes and turns off speaker
   WPAD_SPEAKER_CMD_ON     = 1, //!< Turns on and initializes speaker to use 4-bit Yamaha ADPCM data format at 3000 Hz
   WPAD_SPEAKER_CMD_MUTE   = 2, //!< Mutes speaker
   WPAD_SPEAKER_CMD_UNMUTE = 3, //!< Unmutes speaker
   WPAD_SPEAKER_CMD_PLAY   = 4, //!< Allows sound to play
   WPAD_SPEAKER_CMD_ON_ALT = 5, //!< Does the same as WPAD_SPEAKER_CMD_ON
} WPADSpeakerCmd;

//! MotionPlus Mode.
typedef enum WPADMplsMode
{
   WPAD_MPLS_MODE_DISABLE      = 0,
   WPAD_MPLS_MODE_MPLS_ONLY    = 4, //!< MotionPlus exclusive mode
   WPAD_MPLS_MODE_MPLS_NUNCHUK = 5, //!< Nunchuk passthrough mode
   WPAD_MPLS_MODE_MPLS_CLASSIC = 7, //!< Classic passthrough mode
} WPADMplsMode;

typedef enum WPADMplsStatus
{
   WPAD_MPLS_STATUS_ATTACHED   = 0x01, //!< When something is attached to the MotionPlus
   WPAD_MPLS_STATUS_ROLL_CONV  = 0x02, //!< When the roll is in low-velocity mode.
   WPAD_MPLS_STATUS_PITCH_CONV = 0x04, //!< When the pitch is in low-velocity mode.
   WPAD_MPLS_STATUS_YAW_CONV   = 0x08, //!< When the yaw is in low-velocity mode.
   WPAD_MPLS_STATUS_EXT_VALID  = 0x40, //!< When extension data is valid.
   WPAD_MPLS_STATUS_VALID      = 0x80, //!< When MotionPlus data is valid.
} WPADMplsStatus;


//! WPAD Peripheral Memory Space Prefixes
typedef enum WPADPeripheralSpace
{
   WPAD_PERIPHERAL_SPACE_SPEAKER    = 0xA2,
   WPAD_PERIPHERAL_SPACE_EXTENSION  = 0xA4, //!< Any extension other than Motion Plus
   WPAD_PERIPHERAL_SPACE_MOTIONPLUS = 0xA6,
   WPAD_PERIPHERAL_SPACE_DPD        = 0xB0, //!< Infrared
} WPADPeripheralSpace;

//! Balance Board commands.
typedef enum WPADBalanceBoardCmd
{
   WPAD_BALANCE_BOARD_CMD_UPDATE_TEMP = 0x00, //!< Update temperature data.
   WPAD_BALANCE_BOARD_CMD_OFF         = 0x55, //!< Turn Balance Board off.
   WPAD_BALANCE_BOARD_CMD_ON          = 0xAA, //!< Turn Balance Board on.
} WPADBalanceBoardCmd;


//! 2D vector.
struct WPADVec2D
{
   int16_t x;                   //!< x.
   int16_t y;                   //!< y.
};
WUT_CHECK_OFFSET(WPADVec2D, 0x00, x);
WUT_CHECK_OFFSET(WPADVec2D, 0x02, y);
WUT_CHECK_SIZE(WPADVec2D, 0x04);

//! 3D vector.
struct WPADVec3D
{
   int16_t x;                   //!< x
   int16_t y;                   //!< y
   int16_t z;                   //!< z
};
WUT_CHECK_OFFSET(WPADVec3D, 0x00, x);
WUT_CHECK_OFFSET(WPADVec3D, 0x02, y);
WUT_CHECK_OFFSET(WPADVec3D, 0x04, z);
WUT_CHECK_SIZE(WPADVec3D, 0x06);

//! A single IR dot tracked by the camera.
struct WPADIRDot
{
   WPADVec2D pos;               //!< Position (in a 1024x768 grid).
   uint16_t  size;              //!< Apparent size (0-15).
   uint8_t   id;                //!< Identifier.
};
WUT_CHECK_OFFSET(WPADIRDot, 0x0, pos);
WUT_CHECK_OFFSET(WPADIRDot, 0x4, size);
WUT_CHECK_OFFSET(WPADIRDot, 0x6, id);
WUT_CHECK_SIZE(WPADIRDot, 0x8);

/**
 * Core wiimote status.
 *
 * Valid for formats:
 * - `WPAD_FMT_CORE`
 * - `WPAD_FMT_CORE_ACC`
 * - `WPAD_FMT_CORE_ACC_DPD`
 */
struct WPADStatus
{
   uint16_t  buttons;           //!< Bitset from `WPADButton`.
   WPADVec3D acc;               //!< Accelerometer data.
   WPADIRDot ir[WPAD_MAX_IR_DOTS]; //!< IR dots tracked.
   uint8_t   extensionType;     //!< One of `WPADExtensionType`.
   int8_t    error;             //!< Error of the last `WPADRead()`.
};
WUT_CHECK_OFFSET(WPADStatus, 0x00, buttons);
WUT_CHECK_OFFSET(WPADStatus, 0x02, acc);
WUT_CHECK_OFFSET(WPADStatus, 0x08, ir);
WUT_CHECK_OFFSET(WPADStatus, 0x28, extensionType);
WUT_CHECK_OFFSET(WPADStatus, 0x29, error);
WUT_CHECK_SIZE(WPADStatus, 0x2a);

/**
 * Wiimote + Nunchuk status.
 *
 * Note that nunchuk buttons (Z and C) are reported in core.buttons.
 *
 * Valid for formats:
 * - `WPAD_FMT_NUNCHUK`
 * - `WPAD_FMT_NUNCHUK_ACC`
 * - `WPAD_FMT_NUNCHUK_ACC_DPD`
 */
struct WPADStatusNunchuk
{
   WPADStatus core;             //!< Wiimote core state + nunchuk buttons.
   WPADVec3D  acc;              //!< Accelerometer data.
   struct
   {
      int8_t x;                 //!< [-128, 127]
      int8_t y;                 //!< [-128, 127]
   } stick;
};
WUT_CHECK_OFFSET(WPADStatusNunchuk, 0x00, core);
WUT_CHECK_OFFSET(WPADStatusNunchuk, 0x2a, acc);
WUT_CHECK_OFFSET(WPADStatusNunchuk, 0x30, stick.x);
WUT_CHECK_OFFSET(WPADStatusNunchuk, 0x31, stick.y);
WUT_CHECK_SIZE(WPADStatusNunchuk, 0x32);

/**
 * Classic Controller and Classic Controller Pro status.
 *
 * Valid for formats:
 * - `WPAD_FMT_CLASSIC`
 * - `WPAD_FMT_CLASSIC_ACC`
 * - `WPAD_FMT_CORE_ACC_DPD_FULL`
 * - `WPAD_FMT_GUITAR`
 * - `WPAD_FMT_DRUM`
 * - `WPAD_FMT_TAIKO`
 */
struct WPADStatusClassic
{
   WPADStatus core;
   uint16_t   buttons;          //!< Bitset from `WPADClassicButton`.
   WPADVec2D  leftStick;        //!< Left stick: [-512, 511] x [-512, 511]
   WPADVec2D  rightStick;       //!< Right stick: [-512, 511] x [-512, 511]
   uint8_t    leftTrigger;
   uint8_t    rightTrigger;
};
WUT_CHECK_OFFSET(WPADStatusClassic, 0x00, core);
WUT_CHECK_OFFSET(WPADStatusClassic, 0x2a, buttons);
WUT_CHECK_OFFSET(WPADStatusClassic, 0x2c, leftStick);
WUT_CHECK_OFFSET(WPADStatusClassic, 0x30, rightStick);
WUT_CHECK_OFFSET(WPADStatusClassic, 0x34, leftTrigger);
WUT_CHECK_OFFSET(WPADStatusClassic, 0x35, rightTrigger);
WUT_CHECK_SIZE(WPADStatusClassic, 0x36);

/**
 * Pro Controller status.
 *
 * Valid for formats:
 * - `WPAD_FMT_PRO_CONTROLLER`
 */
struct WPADStatusProController
{
   WPADStatus core;
   WUT_PADDING_BYTES(2);
   uint32_t   buttons;          //!< Bitset from `WPADProButton`.
   WPADVec2D  leftStick;        //!< Left stick: [-2048, 2047] x [-2048 x 2047]
   WPADVec2D  rightStick;       //!< Right stick: [-2048, 2047] x [-2048 x 2047]
   BOOL       charging;
   BOOL       wired;
};
WUT_CHECK_OFFSET(WPADStatusProController, 0x00, core);
WUT_CHECK_OFFSET(WPADStatusProController, 0x2C, buttons);
WUT_CHECK_OFFSET(WPADStatusProController, 0x30, leftStick);
WUT_CHECK_OFFSET(WPADStatusProController, 0x34, rightStick);
WUT_CHECK_OFFSET(WPADStatusProController, 0x38, charging);
WUT_CHECK_OFFSET(WPADStatusProController, 0x3c, wired);
WUT_CHECK_SIZE(WPADStatusProController, 0x40);

/**
 * MotionPlus status.
 *
 * Use `core.extensionType` to determine if `nunchuk` or `classic` are valid.
 *
 * Valid for formats:
 * - `WPAD_FMT_MPLUS`
 */
struct WPADStatusMotionPlus
{
   WPADStatus core;
   union
   {
      struct
      {
         WPADVec3D acc;         //!< Accelerometer data.
         struct
         {
            int8_t x;           //!< x: [-128, 127]
            int8_t y;           //!< y: [-128, 127]
         } stick;
      } nunchuk;
      struct
      {
         uint16_t  buttons;     //!< Bitset from `WPADClassicButton`.
         WPADVec2D leftStick;   //!< Left stick: [-512, 511] x [-512, 511]
         WPADVec2D rightStick;  //!< Right stick: [-512, 511] x [-512, 511]
         uint8_t   leftTrigger;
         uint8_t   rightTrigger;
      } classic;
   };
   uint8_t         status;      //!< Bitset from WPADMplsStatus
   WUT_PADDING_BYTES(1);
   WPADVec3D       angle;
};
WUT_CHECK_OFFSET(WPADStatusMotionPlus, 0x00, core);
WUT_CHECK_OFFSET(WPADStatusMotionPlus, 0x2a, nunchuk.acc);
WUT_CHECK_OFFSET(WPADStatusMotionPlus, 0x30, nunchuk.stick);
WUT_CHECK_OFFSET(WPADStatusMotionPlus, 0x2a, classic.buttons);
WUT_CHECK_OFFSET(WPADStatusMotionPlus, 0x2c, classic.leftStick);
WUT_CHECK_OFFSET(WPADStatusMotionPlus, 0x30, classic.rightStick);
WUT_CHECK_OFFSET(WPADStatusMotionPlus, 0x34, classic.leftTrigger);
WUT_CHECK_OFFSET(WPADStatusMotionPlus, 0x35, classic.rightTrigger);
WUT_CHECK_OFFSET(WPADStatusMotionPlus, 0x36, status);
WUT_CHECK_OFFSET(WPADStatusMotionPlus, 0x38, angle);
WUT_CHECK_SIZE(WPADStatusMotionPlus, 0x3e);

/**
 * Balance Board status.
 *
 * Valid for formats:
 * - `WPAD_FMT_BALANCE_BOARD`
 */
struct WPADStatusBalanceBoard
{
   WPADStatus core;
   uint16_t   pressure[WPAD_MAX_PRESSURE_SENSORS];
   int8_t     temperature;
   uint8_t    battery;
};
WUT_CHECK_OFFSET(WPADStatusBalanceBoard, 0x00, core);
WUT_CHECK_OFFSET(WPADStatusBalanceBoard, 0x2a, pressure);
WUT_CHECK_OFFSET(WPADStatusBalanceBoard, 0x32, temperature);
WUT_CHECK_OFFSET(WPADStatusBalanceBoard, 0x33, battery);
WUT_CHECK_SIZE(WPADStatusBalanceBoard, 0x34);

/**
 * Bullet Train controller status.
 *
 * Valid for formats:
 * - `WPAD_FMT_TRAIN`
 */
struct WPADStatusTrain
{
   WPADStatus core;
   uint16_t   buttons;          //!< Bitset from `WPADClassicButton`.
   uint8_t    brake;            //!< Brake (left) lever.
   uint8_t    throttle;         //!< Throttle (right) lever.
};
WUT_CHECK_OFFSET(WPADStatusTrain, 0x00, core);
WUT_CHECK_OFFSET(WPADStatusTrain, 0x2a, buttons);
WUT_CHECK_OFFSET(WPADStatusTrain, 0x2c, brake);
WUT_CHECK_OFFSET(WPADStatusTrain, 0x2d, throttle);
WUT_CHECK_SIZE(WPADStatusTrain, 0x2e);

//! Controller status info
struct WPADInfo
{
   uint32_t irEnabled;
   uint32_t speakerEnabled;
   uint32_t extensionAttached;
   uint32_t batteryLow;
   uint32_t batteryNearEmpty;
   uint8_t  batteryLevel;
   uint8_t  led;
   uint8_t  protocol;
   uint8_t  firmware;
};
WUT_CHECK_OFFSET(WPADInfo, 0x00, irEnabled);
WUT_CHECK_OFFSET(WPADInfo, 0x04, speakerEnabled);
WUT_CHECK_OFFSET(WPADInfo, 0x08, extensionAttached);
WUT_CHECK_OFFSET(WPADInfo, 0x0c, batteryLow);
WUT_CHECK_OFFSET(WPADInfo, 0x10, batteryNearEmpty);
WUT_CHECK_OFFSET(WPADInfo, 0x14, batteryLevel);
WUT_CHECK_OFFSET(WPADInfo, 0x15, led);
WUT_CHECK_OFFSET(WPADInfo, 0x16, protocol);
WUT_CHECK_OFFSET(WPADInfo, 0x17, firmware);
WUT_CHECK_SIZE(WPADInfo, 0x18);


struct WPADiQueueElement
{
   uint8_t data[0x30];
};
WUT_CHECK_OFFSET(WPADiQueueElement, 0x00, data);
WUT_CHECK_SIZE(WPADiQueueElement, 0x30);

struct WPADiQueue
{
   uint8_t frontIndex;
   uint8_t backIndex;
   WUT_PADDING_BYTES(2);
   WPADiQueueElement* elements;
   uint32_t capacity;
};
WUT_CHECK_OFFSET(WPADiQueue, 0x00, frontIndex);
WUT_CHECK_OFFSET(WPADiQueue, 0x01, backIndex);
WUT_CHECK_OFFSET(WPADiQueue, 0x04, elements);
WUT_CHECK_OFFSET(WPADiQueue, 0x08, capacity);
WUT_CHECK_SIZE(WPADiQueue, 0xc);

//! Bluetooth device address
struct WPADAddress
{
   uint8_t btDeviceAddress[6];
};
WUT_CHECK_OFFSET(WPADAddress, 0x00, btDeviceAddress);
WUT_CHECK_SIZE(WPADAddress, 0x6);

typedef void (*WPADCallback)(WPADChan channel, WPADError status);
typedef WPADCallback WPADControlLedCallback;
typedef WPADCallback WPADControlDpdCallback;
typedef WPADCallback WPADControlSpeakerCallback;
typedef WPADCallback WPADIsMplsAttachedCallback;
typedef WPADCallback WPADGetInfoCallback;
typedef WPADCallback WPADReadMemoryCallback;
typedef WPADCallback WPADWriteMemoryCallback;
typedef WPADCallback WPADConnectCallback;
typedef WPADCallback WPADiSendCallback;
typedef WPADCallback WPADiWriteGameDataCallback;

typedef void (*WPADSamplingCallback)(WPADChan channel);

/**
 * Callback called when the active extension changes
 */
typedef void (*WPADExtensionCallback)(WPADChan channel, WPADExtensionType ext);


/**
 * Initialises the WPAD library for use.
 */
void
WPADInit(void);

/**
 * Cleans up and frees the WPAD library.
 */
void
WPADShutdown(void);

/**
 * Immediately disconnects the associated controller
 */
void
WPADDisconnect(WPADChan channel);
